** Ejemplo 1 - Proceso padre-hijo
   #+BEGIN_SRC C :results output
     #include <stdio.h>
     #include <sys/types.h>
     #include <unistd.h>

     int main(void){
       pid_t pid = fork();

       int numero = 1;

       printf("Hola..! ");
       // fork() retorna 0, cuando es un proceso hijo
       if(pid == 0){
         numero++;
         printf("Soy un proceso hijo\n");
         printf("> mi (PID) es %d \n", getpid());
         printf("> el (PID) de mi proceso padre es %d\n", getppid());
       }
       // fork() retorna un n > 0, cuando es el proceso padre
       else{ // pid > 0
         printf("Soy un proceso padre\n");
         printf("> mi (PID) es %d \n", getpid());
       }

       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : Hola..! Soy un proceso padre
   : > mi (PID) es 29485 
   : Hola..! Soy un proceso hijo
   : > mi (PID) es 29486 
   : > el (PID) de mi proceso padre es 29485

** Ejemplo 2 - Procesos independientes
   Cada proceso es independiente y no puede modificar los datos del otro.

   Nuestro *proceso padre* va a incrementar ~numero~ en 1, imprimiendo 2
   mientras que el *proceso hijo* decrementará ~numero~ en 1, imprimiendo 0

   El *proceso padre* sabe saludar diciendo "Hola..!", y como el *proceso hijo*
   es una copia idéntica, también lo sabrá hacer...! :)

  #+BEGIN_SRC C :results output
    #include <stdio.h>
    #include <sys/types.h>
    #include <unistd.h>

    int main(void){
      pid_t pid = fork();

      int numero = 1;

      printf("Hola..! ");
      // fork() retorna 0, cuando es un proceso hijo
      if(pid == 0){
        printf("Soy un proceso hijo (pid=%d)\n", getpid());
        printf("Mi numero modificado es %d\n", --numero);
      }
      // fork() retorna un n > 0, cuando es el proceso padre
      else if(pid > 0){
        printf("Soy un proceso padre (pid=%d)\n", getpid());
        printf("Mi numero modificado es %d\n", ++numero);
      }
      // fork() retorna n<0 en caso de error
      else{
      }

      printf("------------------------\n");

      return 0;
    }
  #+END_SRC

  #+RESULTS: probando.c
  : Hola..! Soy un proceso padre (pid=24549)
  : Mi numero modificado es 2
  : ------------------------
  : Hola..! Soy un proceso hijo (pid=0)
  : Mi numero modificado es 0
  : ------------------------
** Ejemplo 4 - Proceso huerfano
   Un proceso se considera *proceso huerfano* cuando su *proceso padre*
   finaliza antes que él.
   
   #+BEGIN_SRC C :results output
     #include <stdio.h>
     #include <stdlib.h>
     #include <unistd.h>
     #include <sys/types.h>

     int main(void){
       pid_t pid;

       pid = fork();

       if(pid == 0){
         sleep(10);
         printf("Proceso hijo: y mi proceso padre??? soy un proceso huerfano? :(\n");
       }
       else{ // pid > 0
         printf("Proceso padre: Hola, soy un proceso padre, estoy cansado, chau! \n");
         printf("el proceso padre finalizó...\n");
       }

       return 0;
     }
   #+END_SRC

   #+RESULTS:
   : Proceso padre: Hola, soy un proceso padre, estoy cansado, chau! 
   : el proceso padre finalizó...
   : Proceso hijo: y mi proceso padre??? soy un proceso huerfano? :(

